In [1]:
import pandas as pd 
import psycopg2

In [2]:
conn = psycopg2.connect(host='localhost',
                        dbname='sql_practice',
                        user='postgres',
                        password='Aujaswi@31',
                        port=5432)
conn.autocommit = True
cur = conn.cursor()

# Question

### Given a list of projects and employees mapped to each project, calculate by the amount of project budget allocated to each employee. The output should include the project title and the project budget rounded to the closest integer. Order your list by projects with the highest budget per employee first.

## Creating the table

In [3]:
cur.execute("""CREATE TABLE ms_projects(id int, title varchar(15), budget int);""")

In [4]:
cur.execute("""CREATE TABLE ms_emp_projects(emp_id int, project_id int);""")

## Populating the table

In [5]:
cur.execute("""INSERT INTO ms_projects VALUES (1, 'Project1',  29498),(2, 'Project2',  32487),(3, 'Project3',  43909),(4, 'Project4',  15776),(5, 'Project5',  36268),(6, 'Project6',  41611),(7, 'Project7',  34003),(8, 'Project8',  49284),(9, 'Project9',  32341),(10, 'Project10',    47587),(11, 'Project11',    11705),(12, 'Project12',    10468),(13, 'Project13',    43238),(14, 'Project14',    30014),(15, 'Project15',    48116),(16, 'Project16',    19922),(17, 'Project17',    19061),(18, 'Project18',    10302),(19, 'Project19',    44986),(20, 'Project20',    19497);""")

In [6]:
cur.execute("""INSERT INTO ms_emp_projects VALUES (10592,  1),(10593,  2),(10594,  3),(10595,  4),(10596,  5),(10597,  6),(10598,  7),(10599,  8),(10600,  9),(10601,  10),(10602, 11),(10603, 12),(10604, 13),(10605, 14),(10606, 15),(10607, 16),(10608, 17),(10609, 18),(10610, 19),(10611, 20);""")

### Solution

In [7]:
cur.execute("""SELECT p.title, ROUND((p.budget/COUNT(e.emp_id)),0) budget_per_employee FROM ms_emp_projects e
INNER JOIN ms_projects AS p ON e.project_id = p.id
GROUP BY p.id, p.title, p.budget
ORDER BY 2 DESC;""")

In [8]:
df = pd.DataFrame(cur.fetchall(),columns=['title','budget_per_employee'])

In [9]:
df

        title budget_per_employee
0    Project8               49284
1   Project15               48116
2   Project10               47587
3   Project19               44986
4    Project3               43909
5   Project13               43238
6    Project6               41611
7    Project5               36268
8    Project7               34003
9    Project2               32487
10   Project9               32341
11  Project14               30014
12   Project1               29498
13  Project16               19922
14  Project20               19497
15  Project17               19061
16   Project4               15776
17  Project11               11705
18  Project12               10468
19  Project18               10302

In [10]:
cur.execute("""DROP TABLE ms_projects;""")
cur.execute("""DROP TABLE ms_emp_projects;""")

In [11]:
cur.close()
conn.close()